Revit 2024 API
TemperatureRatingType.MaterialType Property
 Get the material type information which this temperature rating type belongs to.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public WireMaterialType MaterialType { get; }
Visual Basic
Public ReadOnly Property MaterialType As WireMaterialType
	Get
Visual C++
public:
property WireMaterialType^ MaterialType {
	WireMaterialType^ get ();
}
See Also
TemperatureRatingType Class
Autodesk.Revit.DB.Electrical Namespace